ivansigala/drone/frdmmcxn947_cm33_core0/cm33_core0/pin_mux.c
/*
 * Copyright 2022-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v14.0
processor: MCXN947
package_id: MCXN947VDF
mcu_data: ksdk2_0
processor_version: 0.14.14
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: A1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P0, pin_signal: PIO1_8/WUU0_IN10/LPTMR1_ALT3/TRACE_DATA0/FC4_P0/FC5_P4/CT_INP8/SCT0_OUT2/FLEXIO0_D16/PLU_OUT0/ENET0_TXD2/I3C1_SDA/TSI0_CH17/ADC1_A8,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, pull_value: low, input_buffer: enable,
    invert_input: normal}
  - {pin_num: B1, peripheral: LP_FLEXCOMM4, signal: LPFLEXCOMM_P1, pin_signal: PIO1_9/TRACE_DATA1/FC4_P1/FC5_P5/CT_INP9/SCT0_OUT3/FLEXIO0_D17/PLU_OUT1/ENET0_TXD3/I3C1_SCL/TSI0_CH18/ADC1_A9,
    slew_rate: fast, open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable, passive_filter: disable, input_buffer: enable, invert_input: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Enables the clock for PORT0 controller: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port0);

    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);

    /* Enables the clock for PORT2: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);

    /* Enables the clock for PORT3: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port3);
    
    /* Enables the clock for PORT4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port4);

    /* Debug UART */
    const port_pin_config_t port1_8_pinA1_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FC4_P0 */
                                                    kPORT_MuxAlt2,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT1_8 (pin A1) is configured as FC4_P0 */
    PORT_SetPinConfig(PORT1, 8U, &port1_8_pinA1_config);

    const port_pin_config_t port1_9_pinB1_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as FC4_P1 */
                                                    kPORT_MuxAlt2,
                                                    /* Digital input enabled */
                                                    kPORT_InputBufferEnable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT1_9 (pin B1) is configured as FC4_P1 */
    PORT_SetPinConfig(PORT1, 9U, &port1_9_pinB1_config);
    
    /* RC UART */
    /* PORT0_24 (pin B6) is configured as FC1_P0 */
    PORT_SetPinMux(PORT0, 24U, kPORT_MuxAlt2);
    
    PORT0->PCR[24] = ((PORT0->PCR[24] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT0_25 (pin A6) is configured as FC1_P1 */
    PORT_SetPinMux(PORT0, 25U, kPORT_MuxAlt2);

    PORT0->PCR[25] = ((PORT0->PCR[25] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* ESC UART */
    /* PORT3_2 (pin D15) is configured as FC7_P0 */
    PORT_SetPinMux(PORT3, 2U, kPORT_MuxAlt2);

    PORT3->PCR[2] = ((PORT3->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

                     /* PORT3_3 (pin D16) is configured as FC7_P1 */
    PORT_SetPinMux(PORT3, 3U, kPORT_MuxAlt2);

    PORT3->PCR[3] = ((PORT3->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PWM PINS */             
    /* PORT2_0 (pin H2) is configured as PWM1_A3 */
    PORT_SetPinMux(PORT2, 0U, kPORT_MuxAlt5);

    PORT2->PCR[0] = ((PORT2->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_2 (pin H3) is configured as PWM1_A2 */
    PORT_SetPinMux(PORT2, 2U, kPORT_MuxAlt5);

    PORT2->PCR[2] = ((PORT2->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_4 (pin K3) is configured as PWM1_A1 */
    PORT_SetPinMux(PORT2, 4U, kPORT_MuxAlt5);

    PORT2->PCR[4] = ((PORT2->PCR[4] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT2_6 (pin K2) is configured as PWM1_A0 */
    PORT_SetPinMux(PORT2, 6U, kPORT_MuxAlt5);

    PORT2->PCR[6] = ((PORT2->PCR[6] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_IBE_MASK)))

                     /* Input Buffer Enable: Enables. */
                     | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* Configure SPI buses used by the IMU + barometer (added for the
     * BNO085/BME280/Kalman-Z integration). The BNO085 also needs three
     * dedicated GPIOs (RSTN, HINT, PS0/nWAKE) which the BNO driver
     * configures itself via gpio_init() — see bno_08x_init().            */
    LPSPI2_InitPins();   /* PORT4[0..3] — BME280 barometer (FC2)         */
    LPSPI3_InitPins();   /* PORT1[12..15] — BNO085 IMU      (FC3)        */
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI3_InitPins
 * Description   : Configures PORT1[12..15] as the BNO085 IMU SPI bus
 *                 (LP_FLEXCOMM3, ALT3). SDO/SCK/SDI/PCS0.
 *
 * END ****************************************************************************************************************/
void LPSPI3_InitPins(void)
{
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);

    /* SDO (FC3_P0) */
    const port_pin_config_t port1_12_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt3,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT1, 12U, &port1_12_config);

    /* SCK (FC3_P1) */
    const port_pin_config_t port1_13_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt3,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT1, 13U, &port1_13_config);

    /* SDI (FC3_P2) */
    const port_pin_config_t port1_14_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt3,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT1, 14U, &port1_14_config);

    /* PCS0 (FC3_P3) */
    const port_pin_config_t port1_15_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt3,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT1, 15U, &port1_15_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : LPSPI2_InitPins
 * Description   : Configures PORT4[0..3] as the BME280 barometer SPI bus
 *                 (LP_FLEXCOMM2, ALT2). SDO/SCK/SDI/PCS0.
 *
 * END ****************************************************************************************************************/
void LPSPI2_InitPins(void)
{
    /* Enables the clock for PORT4: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port4);

    /* SDO (FC2_P0) */
    const port_pin_config_t port4_0_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt2,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT4, 0U, &port4_0_config);

    /* SCK (FC2_P1) */
    const port_pin_config_t port4_1_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt2,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT4, 1U, &port4_1_config);

    /* SDI (FC2_P2) */
    const port_pin_config_t port4_2_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt2,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT4, 2U, &port4_2_config);

    /* PCS0 (FC2_P3) */
    const port_pin_config_t port4_3_config = {
        kPORT_PullUp, kPORT_LowPullResistor, kPORT_SlowSlewRate,
        kPORT_PassiveFilterDisable, kPORT_OpenDrainDisable,
        kPORT_LowDriveStrength, kPORT_MuxAlt2,
        kPORT_InputBufferEnable, kPORT_InputNormal, kPORT_UnlockRegister};
    PORT_SetPinConfig(PORT4, 3U, &port4_3_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
